Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 感应到两种不同属性的元力如同孪生兄弟般快速融合着，江逸脸上露出狂喜之色，身子立即从床上跃起，对着床边的青石板重重砸下。
en_us: When he felt the effect of the combined forces of two different attributes fusing together like twin brothers, Jiang Yi was elated. He jumped up and smashed heavily down onto the limestone slab beside the bed.

source: 感觉到双手被震得发麻，左胸传来一阵撕裂般的阵痛，看着对方的手掌再次化作一道残影拍来，江逸苦涩的在心里喃喃起来：“完了，怕是今日和小奴，两人都走不出这风月楼了……”
en_us: Jiang Yi felt his arm turn numb from the clash. A searing pain tore through his left chest. Looking at the opponent's palm turning into a phantom shadow once again, Jiang Yi mumbled bitterly, "It's over. Xiaonu and I won't be able to escape this brothel today…"

source: 感觉到那座大山正在一点一点的松动，林立整个人都陷入了兴奋状态中。
en_us: Feeling that the mountain was loosening up bit by bit, Lin Li plunged into a state of excitement.

source: 愿望术卷轴是个好东西，利用它获得一笔数千万的财富，或者是杀死某个神话级生物，甚至是建立自己的王国，这无疑是一个不错的选择，但林立始终觉得，利用它成为一名全职业宗师，这才是最明智的选择。
en_us: The scroll of Wishes was a good item. It could be used to attain millions of wealth, kill a legendary creature, or even build your own kingdom. Each was no doubt a fine choice. But Lin Li constantly felt that using it to become a professional guru was the wisest choice of all.

source: 慌乱中，江逸双手快速运转全部元力，交叉上架格挡，却忘了昨日尝试无名口诀时提炼出来的那一丝黑色元力还储藏在左臂的某条小经脉处，忘了排出体外。当他全力运转江水诀元力的时候，竟把那丝黑色元力也一并运转了起来。
en_us: Frantically, Jiang Yi transferred out all the essence force as quick as he could and crossed his arms to protect his upper frame. However, he forgot that the little sliver of black essence force he had cultivated using the nameless chant last night was still hidden in a small vein on his left arm and that he had forgotten to force it out of his body. When he spent all his energy to transfer the essence force using the Jiang Water Art, he had accidentally transferred the black essence force together with the other forces as well.

source: 战士开了口，身后那几名玩家也相继表达了自己的不满：“这小号有毛病是吧，没事跑到私人仓库来挤什么挤？”
en_us: After the warrior had spoken, the rest of the players expressed their discontent one after another. "Something's wrong with this low-level, coming here and taking up a space for nothing."

source: 战斗了一炷香时间，翊凌雪浑身大汗淋漓，完美曲线再次暴露无遗，她却浑然不觉，娇喝一声，双拳如暴雨般呼啸而来，刹那间漫天都是拳影，足足有十个之多。
en_us: After fighting for five minutes, Yi Lingxue's entire body was covered in sweat, allowing her perfect bodily figure to come to light. However, she remained totally unaware of this. Instead, with a delicate shout, she sent both her fists flying like a thunderstorm, leaving the air filled with the silhouettes of fists, numbering ten of such figures, within a split second.

source: 房门关闭，姬听雨看到江逸眼中的无奈，浅浅一笑道：“易公子不用担忧，有听雨在，马公子和柳公子不会为难你的。”
en_us: Shutting the doors, Ji Tingyu saw the exasperation in Jiang Yi's eyes and smiled lightly, "Young Master Yi need not worry. Tingyu will not let Young Master Ma and Young Master Liu make things difficult for you."

source: 房门轰然关上，三位公子站了一会全部转身快步离开，这姬小姐三人追求了几年了总是不温不火，三人早就习惯了，也不敢过多的纠缠。
en_us: The door to the room slammed shut. All three gentlemen stood at the same spot for a while, before simultaneously turning around and leaving at a quick pace. This Young Mistress Yi had never been receptive to the three men's attempts at courtship over the past few years, after all. This circumstance was something they were already used to and as such, they did not dare to entangle themselves too much in her affairs.

source: 房间不大，里面有一个壮汉正对着一名瘦弱的小丫头拳打脚踢，那小丫头整个人蜷缩在地，全身都在颤抖，不停的哭喊恳求，但那壮汉却依旧不断拳打脚踢。
en_us: The room was not big, but in it a stout man was kicking and punching a weak, delicate girl. She was curled on the ground, trembling while constantly crying and begging. However, the man continued to rain down attacks upon her.

source: 房间里一片冷清，没有熟悉的昏暗烛火，也没有那个熟悉的柔弱身影，伏在桌上喘息了好一会，江逸才哆嗦着手点燃烛火，却看到桌上压着一张字条。
en_us: The air in the room was stale and cold. It lacked the familiar, warm glow of a candle and that delicate, weak figure. Jiang Yi leaned over on the table-top to catch his breath. After a few minutes of hoarse panting, he finally sat up and lit the candle with a shaking hand. It was then that he spotted a brief message left on the table.

source: 所为的除了那三十瓶奥法药剂之外，其实更多的还是想跟魔法公会修复关系。
en_us: Apart from that 30 bottles of Arcane Magic Potion, what he had wanted to do more was to repair the relationship with the Guild of Magic.

source: 所以一开始他佯装妥协，让大部分人放松警惕，然后凭借黑色元力增幅的强大力量，一拳把江如鹰轰飞，此刻再趁着众人震愕之中，准备一举拿下江如虎。
en_us: As such, he posed being pro-compromise right from the start, ensuring a large portion of his opponents would let their guard down. Subsequently, he would rely on his great power, expanded in strength by black essence force, and send Jiang Ruying flying with one punch. At that moment, he would take advantage of all his opponents being in a state of shock, and was ready to take Jiang Ruhu down in a single move.

source: 所以他一点也没有犹豫，顺手就把那张脏兮兮的画布揣进了怀里。
en_us: So, without any hesitation, he tucked the dirty canvas into his arms.

source: 所以他一直没有回头。
en_us: So he never looked back.

source: 所以他放出魔法之后，连看都没多看巴瑟罗尔一眼，就将目光挪到了宴会大厅之中，那层魔力太诡异太强大，他对放出这层魔力防护的人，兴趣甚至比对杀死巴瑟罗尔还大。
en_us: So, after he had unleashed the spell, he did not even look at Bathrilor but shifted his eyes to the banquet hall. That layer of magic was too peculiar and powerful; he was much more interested in the person who had cast the magical shield rather than killing Bathrilor.

source: 所以他没怎么犹豫，就从无尽空间之戒中摸出了一把匕首，很小心很小心的，将那一截倒勾从尾巴上切了下来，然后又更加小心的将它放回了无尽空间之戒内。
en_us: So, without much hesitation, he pulled a dagger out of the Ring of Endless Space and very carefully nicked the inverted hook off the tail. Then, as gingerly as ever, he put it back into the Ring of Endless Space.

source: 所以他还是倔强的站在原地，一言不发。
en_us: Thus he still stubbornly stood his ground, not uttering a single word.

source: 所以他顿了一下，不等对方开口就说道：“姬小姐，你们这丹药是收还是不收？不收在下告辞了！”
en_us: As such, he paused for a moment. Not waiting for the other person involved to open her mouth, he just said, "Miss Ji, my elixirs - are you going to accept them, or not? If not, I'm going to take my leave!"

source: 所以听到小奴出事后，江逸立即暴怒起来，满脸狰狞的冲到前院，那如野兽般凶厉的气息把前来报信的少女吓了一跳。
en_us: So when he heard that Xiaonu was in trouble, Jiang Yi exploded with anger. Rushing to the front yard, face brimmed with fury. His ferocious manner gave the messenger girl a huge fright.

source: 所以听说江如虎是被马家的人打了，江家便不予理会了，大总管江云蛇倒是怒气十足，尽管江如虎被打得他都认不出来了，依旧狠狠怒骂了一顿，并下令让江家旁系子弟全部紧闭在家，敢再出去丢人现眼，一律重罚。
en_us: As such, upon hearing that members of the Ma Family had beaten up Jiang Ruhu, the Jiang Clan paid little heed to that piece of information. Contrary to the rest, the Chief Supervisor Jiang Yunshe was filled with rage. Even though Jiang Ruhu had been so brutally injured and mutilated from the fight that his face seemed unrecognisable, Jiang Yunshe still adamantly scolded Jiang Ruhu with much ferocity and even ordered all the collateral descendants to go into seclusion at home. He even set a penalty - should anyone head out of the Residence again and be a disgrace to the Family, there would be a severe punishment.

source: 所以当他听说魔法工会即将拍卖奥法药剂的时候，他真的是高兴坏了，立刻就筹集大笔资金，甚至不惜低价处理了几处赚钱的产业，为的就是让三个儿子顺利成为魔法师。但罗林家族不是梅林家族，他能够调集的资金，总共也只有二十来万，若是这疯女人再继续顶下去，安东尼－罗林真是有些不敢想象……
en_us: So when he heard that he Guild of Magic was going to auction the Arcane Magic Potion, he was utterly thrilled and immediately started to raise money. He had even disposed of several profitable industries at a low price in order to make his three sons into mages successfully. But the Rolin Family was not the Merlin Family. The total amount of money he could gather was only about 200,000. If this mad woman continued to push on, Anthony Rolin dared not imagine what would happen next...

source: 所以林立什么也不说，就等着葛瑞安开口。
en_us: So, Lin Li did not utter a word, and waited for Gerian to speak.

source: 所以此刻江如龙如一头疯牛般冲来，他脸上神情没有半点变幻，而是快速弯身，提起江如虎的另外一条腿，当做武器在半空中抡起，对着江如龙狠狠砸去。
en_us: Which was why Jiang Rulong just charging him like a frenzied bull. Jiang Yi remained calm and quickly bent over to pick up Jiang Ruhu by his other leg to use him as a weapon to smash at Jiang Rulong.

source: 所以此刻江逸心情很是沉重，风月楼竟是马家的产业？今日可别出乱子啊……
en_us: Ergo, Jiang Yi was feeling pretty heavyhearted right now: who knew that Fengyue Brothel was the property of the Ma Family? He could only hope that nothing would go wrong today...

source: 所以此刻江逸没有选择去武殿，而是回了江家！这段时间内，他要是还敢在江家和武殿中来回行走，他相信自己绝对活不过十天。
en_us: Therefore, Jiang Yi chose to return to the Jiang Clan, instead of the Martial Arts Hall. He was certain that he would not be able to survive past ten days, if he dared commute back and forth between the Jiang Clan and the Martial Arts Hall during this period.

source: 所以葛瑞安才想不明白，自己这么大的优势，老梅林干嘛还笑得一脸胜券在握？
en_us: Hence, Gerian could not figure out just why Old Merlin was all smiles in victory when he had such a huge advantage over him.

source: 所以，当老格林打开瓶盖的时候，他就已经完全呆住了，仅仅是这一瓶清醒药剂，就足以颠覆大多数药剂师的常识。
en_us: So, Old Grimm was completely stunned when he opened the bottle cap. Just this bottle of Sobriety Potion was enough to subvert the knowledge of most pharmacists.

source: 所有人不忍的别开眼睛，听着耳边传来的清脆骨头断裂声，他们心头一震，回头看着江逸的目光都充满了畏惧。
en_us: Everyone couldn't help but close their eyes, but the sound of bones cracking could be heard clearly. Their minds shuddered as they looked at Jiang Yi with fear.

source: 所有人心里都充满了劫后余生的庆幸，如果不是这一瓶唤醒药剂，以后的加洛斯恐怕就再没有什么魔法公会了，人生大起大落，果然是太刺激了，先前还将心揪紧的魔法师们，此时却已经有了期待胜利的资格。
en_us: Everyone's heart was filled with the joy of having survived a disaster. If it hadn't been for the bottle of Awakening Potion, there would probably not be any Guild of Magic in Jarrosus in the future. The ups and downs of life were indeed exhilarating. The mages who were clutching their hearts a moment ago could now await the chance for victory.

source: 所有人懵了，只有江豹眼中露出一丝惊恐，他那日的情况和江如鹰一模一样，也是一拳被江逸轰飞……
en_us: Everyone was left dumbstruck. Only Jiang Bao alone had a look of shock and fright revealed through his eyes. His experiences that day were completely similar to what just happened to Jiang Ruying, in that he was also sent flying by a punch from Jiang Yi...

source: 所有人望向他的目光，都好象是在看一个白痴，很多人都已经在心里骂开了，魔法公会怎么出了这么个白痴？这么好的机会不赶紧扑上去拜师，还真要跟格林大师探讨，探讨你妈个大西瓜……
en_us: Everyone looked at him as if they were looking at an idiot. Many had begun cursing in their hearts, How did such an idiot come out from the Guild of Magic? It was such a good opportunity to become Master Grimm's apprentice and he literally wanted to discuss with the master? Damn your stupid discussion...<segm

source: 所有人的目光都落到了亚伦－马齐斯身上，就连几支魔法家族的首脑，都不由有些暗暗吃惊，血色兄弟会一直行事低调，声名远不如老奥丁等人响亮，想不到竟然也有如此的财力与魄力。
en_us: All eyes fell onto Aaron Matsis. Even the leaders of several mage families were surprised; the Blood Brotherhood had always kept a low profile, and its reputation was far less impressive than that of Old Odin... To think that they had such wealth and guts.

source: 所有人的目光都落到了那一点光晕之上，有迷茫有震惊有贪婪有疑惑，各种各样的情绪交织在一起，在翡翠高塔下营造出一幕诡异的气氛。
en_us: Everyone's attention fell upon the halo, and all kinds of emotions intertwined—confusion, shock, greed, and uncertainty—creating a strange atmosphere within the Emerald Tower.

source: 所有人的目光，都落到了声音传来的方向。
en_us: All eyes turned to the direction of the sound.

source: 所有人被江逸的凶厉吓到了，也怕江逸发疯之下，真的把江如虎给活活砸死。那样江逸难逃一死，他们也会被家族重罚的。有一人开始退，其余人也慌忙跟着退后，全部惊恐的望着满脸狰狞的江逸，心里都浮现一个念头，这人还是那个老实巴交的废物江逸吗？怎么发狠起来如此可怕？
en_us: Everyone had been shocked and frightened by Jiang Yi's severe viciousness and ferocity; they were also scared that, in a fit of mad rage, Jiang Yi would really smash Jiang Ruhu on the ground to his death. In that way, Jiang Yi's death penalty would be unavoidable, but they too would have to suffer the consequences of being punished by the Family clan. As one person started to retreated, the rest followed suit in hurriedly falling back. All of them stared in horror at the malevolent expression on Jiang Yi's face, as a single thought appeared in their minds - was this person still that docile good-for-nothing Jiang Yi? How could he become so scary when he showed his ferocity?

source: 所有人都倒吸了一口凉气，宴会大厅中一片此起彼伏的惊呼声，格林－伯恩塞德这个名字，对加洛斯城人来说就是一段活着的传说。
en_us: Everyone drew in a cold breath; the banquet hall was filled with surprised gasps. The name—Grimm Burnside—was a living legend to the people of Jarrosus City.

source: 所谓的要事，其实就是分脏。
en_us: The important thing they meant was to divide the spoils.

source: 所谓陪练，自然是陪着别人练武，帮助对方提高实战经验。换句话说，别人可以随便打你，你也可以还手，但却不能伤了对方，这就是主动挨揍的活儿。
en_us: As a martial arts sparring partner, one naturally had to accompany others in their practice of martial arts and help the other party increase their actual combat experience. In other words, other people could beat you up as they fancied. You could always launch a counter-attack, but you were not allowed to injure the other party: this was the responsibility of actively taking beatings.

source: 手上掌握着深邃之银，他已经有些迫不及待了，他很想知道，镀上了深邃之银的点金棒，将会拥有何种神奇的力量……
en_us: He couldn't wait any longer now that he had the deep silver in his hands. He really wanted to know the kind of magical power a gold bar coated with deep silver would possess...

source: 才刚刚穿过一片密林，林立就忽然看见，前方树丛中一阵叶浪翻腾，三条人影正在那一片叶浪当中飞速移动。
en_us: Lin Li had just passed through the dense woods when, all of a sudden, he saw the leaves billow in the bushes ahead—three figures were hurtling through the sea of leaves.

source: 扫了一眼，江逸很快就意味索然了，这武殿是在招收陪练武者。待遇倒是很诱人，铜牌陪练一天一两银子，银牌陪练一天十两，金牌陪练甚至达到了一两紫金一天。
en_us: After scanning through the notice, Jiang Yi very quickly lost his interest. The Martial Arts Hall was calling for applicants for martial arts sparring partners. Frankly, the remuneration was very attractive: a bronze-token-grade sparring partner would earn a tael of silver a day, one with a silver token would earn ten taels of silver a day, and one with a gold token could even earn up to a tael of purple gold a day.

source: 扶着中年男人一路奔逃的是一对年轻男女，那男的身上穿着一件做工精细的魔法长袍，看上去应该是出身不错的魔法师才对，特别是手上那根法杖，就算是以林立的眼光看来，也不得不说声不错。
en_us: A young man and a woman held onto the middle-aged man as they fled. The young man was wearing a mage robe made with fine craftsmanship, he seemed to be a mage from a good family background. In particular, the staff he held in his hand was a rather decent one even with Lin Li's eyes.

source: 找到了麦格雷尼沉睡的原因，林立也稍稍松了口气，黄昏诅咒虽然厉害，却并不是完全无解，至少他就知道两种解决的方法。
en_us: Lin Li heaved a sigh of relief as he found the cause of McGrenn's deep slumber. Although the Twilight Curse was formidable, it was not entirely unbreakable—at least he knew of two ways that could resolve it.

source: 抄录魔法是件很麻烦的事，特别是象林立这种半吊子，语言基础太差，除了通用语之外，其他语言对他来说就是标准的天书，于是他不得不一边翻看各种语言入门，一边将那一条条咒语抄进魔法书里。
en_us: Copying the spells was a burdensome thing to do, particularly for a dabbler like Lin Li who had a poor foundation in the local language. Other than the lingua franca, all other languages were Greek to him. So, he had to go through different language guides as he wrote the spells down into the magic book.

source: 把一瓶魔力药水倒进安眠水晶瓶里，等了几个月之后拿出来一喝，这一瓶魔力药水的效果，竟堪堪达到了唤醒药剂的效果！
en_us: If you pour a bottle of magic potion into the Hypnotic Crystal bottle and drink it after a few months, the effects were that of an Awakening Potion!

source: 把所有药草准备好，江逸擦了擦额头上的汗水，站起身朝外走去，却看到一个披头散发的老头正站在他身后盯着他看，这种感觉就像酣睡中发现厉鬼在侧般恐怖……
en_us: After preparing all the medicinal herbs, Jiang Yi wiped off the sweat on his forehead, stood up and walked outside. However, he saw an old man with disheveled hair standing behind him and staring at him. The horrible feeling he got was akin to discovering a scary ghost on one's side while one was in deep slumber...

source: 报信的少女，江逸认识，是住旁边的一名江家老奴的女儿，平时和小奴走得近，也经常一起偷偷出去做工。
en_us: Jiang Yi recognized the young girl bearing the news, it was the daughter of an elderly Jiang Clan chambermaid staying next door. She and Xiaonu were good friends and sometimes would sneak out together for work.

source: 抱着这样的想法，林立的眼光自然也不象平时那么挑剔了，转过两个街角之后，很快就看到了一间尚未关门的装备店。
en_us: With this thought in mind, Lin Li was less picky than usual. After turning around two corners, a gear shop which was still open soon came into sight.

source: 拍卖会终于落下了帷幕，一老一少拿出了三十三瓶奥法药剂，收获的却是一百多万金币，一百套精良的魔法装备，外加一个如日中天的魔法公会。
en_us: The auction finally came to an end. The old and the young had brought out 33 bottles of Arcane Magic Potion and harvested over a million gold coins, 100 sets of excellent magic equipment, and a Guild of Magic at the peak of its power.

source: 拒绝一个小小的红发美女，林立干起来还是没什么心理负担的……
en_us: Rejecting a little redhead beauty was not so much of a psychological burden to Lin Li at all...

source: 拥有了药剂大师之后，魔法公会已经有了崛起的机会，只要借着拍卖三十瓶奥法药剂的东风，魔法公会将会在短时间内发展到一个可观的程度，到了那个时候，什么十一魔法家族，什么六大地下势力，统统都要看魔法公会的脸色行事。
en_us: After having the potion master, the Guild of Magic already had the opportunity to rise. So long as they auctioned off the 30 bottles of Arcane Magic Potion, the Guild of Magic would be able to grow to a considerable degree in a short time. By that time, the 11 mage families and six underground forces would all have to adjust their behavior toward the guild's expressions.

source: 拿了戒指正准备闪人，却忽然看见那张被涂得五颜六色的画布。
en_us: Lin Li was about to leave after getting the ring when the colorful canvas caught his eyes.

source: 拿起那几片花瓣，完全是下意识的，就好象你把手伸到美女胸口，总会很自然的捏上一捏，这真的不是耍流氓，只是一种很自然的反应……
en_us: Picking up that few petals was an instinctual reaction. Just like how one would naturally grasp a woman's breasts when he had his arms stretched in front of her chest. It was not a hooligan's behaviour, but an extremely natural reaction...

source: 挨了一脚，利维坦猩猩却是如蒙大赦，吭哧吭哧的就钻入了树林深处。
en_us: The Leviathan Gorilla seemed to have received an amnesty from being kicked, and with a puff it dived into the depths of the forest.

source: 换了大多数魔法师来，恐怕都要对这两个标准嗤之以鼻。
en_us: Most mages would have scoffed at these criteria.

source: 据伊娜所说，今天早晨她来的时候，麦格雷尼已经瘦得不成样子了。
en_us: According to Ina, McGrenn had been worn down to a shadow when she came this morning.

source: 据大长老说，是他娘亲在他一岁时购买的弃婴，给他做侍女的。尽管名分上是侍女，但江逸和江小奴一同长大，情同兄妹，在大长老失踪后两人更是相依为命。这些年来如果不是江小奴一直为他鼓气加油，他也不知道能不能坚持下来！
en_us: According to the Grand Elder, his mother bought Xiaonu as a maid to serve him when he was one years old. Although her status was just a maid in the household, Xiaonu was never treated like one—she grew up together with Jiang Yi like a sibling. After the disappearance of the Grand Elder, each depended on the other for survival. If not for Xiaonu's constant encouragement, it would have been hard for Jiang Yi to endure the difficult times.

source: 据说就连老奥丁找上门去，葛瑞安都给他碰了个钉子，整个加洛斯城谁不知道，这两个老家伙是穿一条裤子的？听说连老奥丁都碰了钉子，梅林家族刚要伸出去示好的手，顿时又收了回来……
en_us: It was said that even when Old Odin came calling, Gerian had given him a flat refusal. Everyone in Jarrosus City knew that both of them wore the same pair of pants growing up. The Merlin Family was just about to extend a friendly hand but immediately pulled it back after hearing that even Old Odin had been turned away...

source: 据说无尽世界里，就有人做过实验。
en_us: Legend says that one had done an experiment in the Endless World.

source: 接待他的还是上次的刘管事，刘管事客气的将江逸带进雅阁内，招来侍女奉上香茗后，才微笑问道：“公子，您这次是又准备出售丹药吗？难道有好货色？”
en_us: The person who greeted him was Housekeeper Liu, who he had met before. Housekeeper Liu courteously brought Jiang Yi into an elegant booth. After instructing his maidservant to serve some aromatic tea, he gave a small smile. "Young Master, are you ready to sell more elixirs during this visit? Do you perhaps have some high-quality products?"

source: 接着就听见一阵“哗啦哗啦”的声响，数十枚魔晶骨碌骨碌的就滚到了柜台上。
en_us: What followed were the clattering sounds of dozens of magical crystals rolling out onto the counter desk.

source: 接着那管事就出现了，狠狠扇了江小奴一巴掌，让护卫把小奴带到了后院，让她要么赔钱，要么签卖身契……
en_us: Following that, that housekeeper appeared and viciously gave Jiang Xiaonu a slap and allowed the guard to bring Xiaonu to the backyard, demanding that she pay up for the damages or otherwise sign a contract and sell herself to the household...

source: 揉了揉酸疼的手臂，林立回头望了一眼满面呆滞的围观群众，这才收拾起工具，转身往药剂店方向走去。
en_us: Lin Li massaged his aching shoulder. He took a look back at the stupefied onlookers before packing his tools and turning into the direction of the pharmacy.

source: 摇了摇头，江逸强迫自己不去多想，开始数起数来。荣管事只给了他两个时辰，要是不能及时清点完毕，回去挨骂事小，要被扣掉月例那就太严重了。
en_us: Shaking his head, Jiang Yi forced himself not to overthink and to instead start counting the plants. Chief Rong had only given him four hours to finish this task, after all. If he was unable to finish this work in time, he have to endure yet another scolding and something worse: a salary cut. If his monthly salary was cut, he would be thrown into a truly terrible situation.

source: 摇晃了一下脑袋，江逸重新盘坐起来，暗暗沉吟起来：“嗯……先修炼江水决，这段时间小心些，别被江如虎等人截了。等攒够足够的银钱，我再出去外面购买高级丹药，加快修炼！哼哼，只要我有铸鼎境二重配合黑色元力，江如虎你们敢来找麻烦，看我不把你们一个个打成血猪头？”
en_us: Shaking his head, he returned to his cross-legged sitting posture, quietly muttering, "Hmph... I should first practice the Jiang Water Art. I should be more careful during this period of time and not get caught by Jiang Ruhu and gang. "Once I have acquired enough money, I can head out to purchase high-quality elixirs and speed up my training in refinement! Heh heh! Once I reach the second level of the Cast Tripod Realm and combine that power with black essence force, should Jiang Ruhu dare to come to find trouble... see if I tear you guys up to shreds?"

source: 擒贼先擒王！
en_us: To catch bandits, one must first capture the bandit leader!

source: 放下这枚十五级魔晶之后，林立又拿出一红一绿两块宝石。
en_us: After putting down the level-fifteen magical crystal, Lin Li took out another two gemstones—a ruby and an emerald.

source: 敢来风月楼闹事，他可不管这少年是谁先打了再说，铸鼎境一重在铸鼎境二重的他看来……屁都不是。
en_us: Since the youth dared to barge into Fengyue Brothel to stir trouble, he did not care who he was. A beating was in order. To him, the first or second stage of the Cast Tripod Realm was… nothing to him.

source: 散发出强大压力的同时，老梅林的精神力更是如同海浪一般汹涌澎湃，一波又一波的冲击着旋涡中心的林立。
en_us: At the same time, Old Merlin's mental strength was surging like the torrential tides, dealing an impact with every wave to the center of the vortex where Lin Li stood.

source: 数不清的骸骨巨人、尸人、尸兽和阴兵铺满虚空，密密麻麻，遮天蔽月，它们身上或身周隐隐发亮的暗灰色符文流转不停，光影迷离，规模宏大，似乎把那座原本宏伟神圣，在今夜却显得漆黑寂静的天庭巨城也给比了下去。
en_us: Countless skeleton giants, zombies, zombie-beasts, and yin soldiers crowded the space, blotting out the sky and moon. Grey runic patterns sparkled continuously from their bodies—light and shadows blurred. The spectacle was so grand and divine that even the Heavenly Court city, dark and silent that night, paled in comparison.

source: 数十记风刃，数十根冰锥，若是换个其他魔法师来，恐怕早已耗尽了所有的魔力，也只有林立这种精神力严重畸形的变态，才能继续在椰子雨中坚持下去。
en_us: That numerous shots of wind blades and icicles would probably exhaust the mana of another mage. Only a freak with a serious abnormality of mental strength like Lin Li could persist under the rain of coconuts.

source: 数千金币的草药，搞了差不多足有一周。
en_us: It took him almost a week to use up over thousand gold coins worth of herbs.

source: 敲废几块秘银算得了什么，只要技能点数涨上去就行了。
en_us: What was the big deal about scraping a few pieces of mithril as long as the skill points increased.

source: 整个世界再次变得清晰，时间的流动似乎也凝滞了起来……
en_us: The whole world turned distinct again, and time also seemed to pass sluggishly.

source: 整个丹炉一颤，江逸被一股反震之力推到在地，他眼中都是喜色，昨日不就是炸丹才练出两枚地阶丹药吗？
en_us: The entire cauldron trembled as Jiang Yi was pushed to the ground by the force of a large reverberating shockwave. His eyes were filled with glee. Was it not the case the day before that the two Earth-tier elixirs were refined only after the original pills exploded?

source: 整个丹炉又一次剧烈摇晃，等他打开一看整张脸都黑了，里面的三枚丹药加上原先的两枚全炸了，变成了残渣，一枚不剩……
en_us: Once again the entire cauldron trembled violently. When he lifted the lid and took a look, he facial expressions turned to one of angry dismay. The three elixir pills inside, in addition to the two original pills, had exploded completely and turned to smithereens, with not a single pill left...

source: 整个加洛斯城都疯了，但凡有资格竞争的势力，都在拼命的往翡翠高塔挤。
en_us: The whole Jarrosus City had become crazy. All the powers qualified for the competition were fighting to force their way into the Emerald Tower.

source: 整天跟林立这种妖孽在一起，凯文没法不觉得失落。
en_us: Kevin could not help but feel dejected hanging out with a freak like Lin Li every day.
